tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "antibody" # Plugin manager for zsh
brew "awscli"
brew "bat" # Like bat, but better
brew "ctop"
# cask "cyberduck"
brew "fd" # Intuitive find CLI
brew "fx" # Json Viewer https://github.com/antonmedv/fx
brew "fzf" # It's an interactive Unix filter for command-line.
brew "gh"
brew "git"
brew "gnupg"
brew "grc" # Colorize logfiles and command output.
brew "jq" # JSON processor, required by `nx``
brew "mas" # Install apps from app store
brew "nvm"
brew "pinentry-mac"
brew "pnpm"
brew "pstree"
brew "ripgrep" # https://github.com/BurntSushi/ripgrep
brew "starship" # Terminal theme
brew "tldr" # better than man command
brew "vim"
brew "zsh"
cask "adguard"
cask "appcleaner"
cask "audacity"
cask "authy"
cask "brave-browser"
cask "dash"
cask "discord"
cask "docker"
cask "drawio"
cask "figma"
cask "firefox-developer-edition"
cask "font-jetbrains-mono" # Code editor
cask "font-jetbrains-mono-nerd-font" # Terminal
cask "ganache" # Ethereum dev blockchain
cask "google-chrome"
cask "iina" # Player
cask "kap" # Screen Recording
cask "microsoft-edge"
cask "notion"
cask "orion" # Testing
cask "postman"
cask "raycast"
cask "shottr"
cask "spotify"
cask "stremio"
cask "sublime-text"
cask "tableplus"
cask "tradingview"
cask "visual-studio-code"
cask "warp"
cask "aldente"
mas "Dashlane", id: 517914548
mas "Hidden Bar", id: 1452453066
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Notion Web Clipper", id: 1559269364 # For Safari
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenBrush", id: 1233965871 # Testing
mas "Slack", id: 803453959
mas "Spark Desktop", id: 6445813049
mas "Taskheat", id: 1431995750 # Testing
mas "Telegram", id: 747648890
mas "Velja", id: 1607635845 # Default browser per link
mas "Vidimote", id: 1585702412 # For Safari
mas "WhatsApp", id: 1147396723
